Revit 2024 API
RebarUpdateCurvesData.GetBarModelDiameter Method
 Gets the model diameter of the Rebar.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public double GetBarModelDiameter()
Visual Basic
Public Function GetBarModelDiameter As Double
Visual C++
public:
double GetBarModelDiameter()
Return Value
 Returns the model diameter of the Rebar.
See Also
RebarUpdateCurvesData Class
Autodesk.Revit.DB.Structure Namespace